JonasArnold/ArtNetE131Lib_esp8266/ArtNetE131Lib.cpp
			}
		}

		// Send packet
		eUDP.beginPacket(_art->broadcastIP, ARTNET_PORT);
		eUDP.write(_artReplyBuffer, ARTNET_REPLY_SIZE);
		eUDP.endPacket();

		delay(0);
	}
}


void espArtNetRDM::artPollReply() {
	if (_art == 0)
		return;

	_artPoll();
}

void espArtNetRDM::_artDMX(unsigned char *_artBuffer) {
	group_def* group = 0;

	IPAddress rIP = eUDP.remoteIP();

	uint8_t net = (_artBuffer[15] & 0x7F);
	uint8_t sub = (_artBuffer[14] >> 4);
	uint8_t uni = (_artBuffer[14] & 0x0F);

	// Number of channels hi byte first
	uint16_t numberOfChannels = _artBuffer[17] + (_artBuffer[16] << 8);
	uint16_t startChannel = 0;

	// Loop through all groups
	for (int x = 0; x < _art->numGroups; x++) {
		if (net == _art->group[x]->netSwitch && sub == _art->group[x]->subnet) {
			group = _art->group[x];

			// Loop through each port
			for (int y = 0; y < 4; y++) {
				if (group->ports[y] == 0 || group->ports[y]->portType == SEND_DMX)
					continue;

				// If this port has the correct Net, Sub & Uni then save DMX to buffer
				if (uni == group->ports[y]->portUni)
					_saveDMX(&_artBuffer[ARTNET_ADDRESS_OFFSET], numberOfChannels, x, y, rIP, startChannel);
			}
		}
	}
}

void espArtNetRDM::_saveDMX(unsigned char *dmxData, uint16_t numberOfChannels, uint8_t groupNum, uint8_t portNum, IPAddress rIP, uint16_t startChannel) {
	group_def* group = _art->group[groupNum];
	port_def* port = group->ports[portNum];

	uint8_t senderID = 255;  // Will be set to 0 or 1 if valid later

	unsigned long timeNow = millis();

	// We can't do the next calculations until after 10 seconds
	if (timeNow > 10000) {
		unsigned long timeExp = timeNow - 10000;

		// Clear IPs that we haven't heard from in over 10 seconds
		if (port->lastPacketTime[0] < timeExp)
			port->senderIP[0] = INADDR_NONE;
		else if (port->lastPacketTime[1] < timeExp)
			port->senderIP[1] = INADDR_NONE;
	}

	// Get a sender ID
	if (port->senderIP[0] == rIP) {
		senderID = 0;
		port->lastPacketTime[0] = timeNow;
	}
	else if (port->senderIP[1] == rIP || port->senderIP[1] == INADDR_NONE) {
		senderID = 1;
		port->senderIP[1] = rIP;
		port->lastPacketTime[1] = timeNow;
	}
	else if (port->senderIP[0] == INADDR_NONE) {
		senderID = 0;
		port->senderIP[0] = rIP;
		port->lastPacketTime[0] = timeNow;
	}

	// This is a third IP so drop the packet (Artnet v4 only allows for merging 2 DMX streams)
	if (senderID == 255)
		return;

	// Check if we're merging (the other IP will be non zero)
	if (port->senderIP[(senderID ^ 0x01)] == INADDR_NONE)
		port->merging = false;
	else
		port->merging = true;


	// Cancel merge is old so cancel the cancel merge
	if ((group->cancelMergeTime + ARTNET_CANCEL_MERGE_TIMEOUT) < millis()) {
		group->cancelMerge = false;
		group->cancelMergeIP = INADDR_NONE;

	}
	else {
		// This is the correct IP, enable cancel merge
		if (group->cancelMergeIP == port->senderIP[senderID]) {
			group->cancelMerge = 1;
			group->cancelMergeTime = millis();
			port->mergeHTP = false;
			port->merging = false;

			// If the merge is current & IP isn't correct, ignore this packet
		}
		else if (group->cancelMerge)
			return;
	}

	// Store number of channels
	if (numberOfChannels > port->dmxChans)
		port->dmxChans = numberOfChannels;

	// Check if we should merge (HTP) or not merge (LTP)
	if (port->merging && port->mergeHTP) {
		// Check if there is a buffer.  If not, allocate and clear it
		if (port->ipBuffer == 0) {

			port->ipBuffer = (byte*)os_malloc(2 * DMX_BUFFER_SIZE);
			delay(0);
			_artClearDMXBuffer(port->ipBuffer);
			_artClearDMXBuffer(&port->ipBuffer[DMX_BUFFER_SIZE]);
			delay(0);
		}

		// Put data into our buffer
		memcpy(&port->ipBuffer[senderID * DMX_BUFFER_SIZE + startChannel], dmxData, numberOfChannels);

		// Get the number of channels to compare
		numberOfChannels = (port->dmxChans > numberOfChannels) ? port->dmxChans : numberOfChannels;

		// Compare data and put in the output buffer
		for (uint16_t x = 0; x < numberOfChannels; x++)
			port->dmxBuffer[x] = (port->ipBuffer[x] > port->ipBuffer[x + DMX_BUFFER_SIZE]) ? port->ipBuffer[x] : port->ipBuffer[x + DMX_BUFFER_SIZE];

		// Call our dmx callback in the main script (Sync doesn't get used when merging)
		_art->dmxCallBack(groupNum, portNum, numberOfChannels, false);

	}
	else {
		// Copy data directly into output buffer
		memcpy(&port->dmxBuffer[startChannel], dmxData, numberOfChannels);

		/*
			// Delete merge buffer if it exists
			if (port->ipBuffer != 0) {
			  os_free(port->ipBuffer);
			  port->ipBuffer = 0;
			}
		*/

		// Check if Sync is enabled and call dmx callback in the main script
		if (_art->lastSync == 0 || (_art->lastSync + 4000) < timeNow || _art->syncIP != rIP)
			_art->dmxCallBack(groupNum, portNum, numberOfChannels, false);
		else
			_art->dmxCallBack(groupNum, portNum, numberOfChannels, true);

		//    _art->syncIP = rIP;
	}
}

byte* espArtNetRDM::getDMX(uint8_t g, uint8_t p) {
	if (_art == 0)
		return NULL;

	if (g < _art->numGroups) {
		if (_art->group[g]->ports[p] != 0)
			return _art->group[g]->ports[p]->dmxBuffer;
	}
	return NULL;
}

uint16_t espArtNetRDM::numChans(uint8_t g, uint8_t p) {
	if (_art == 0)
		return 0;

	if (g < _art->numGroups) {
		if (_art->group[g]->ports[p] != 0)
			return _art->group[g]->ports[p]->dmxChans;
	}
	return 0;
}

void espArtNetRDM::_artIPProg(unsigned char *_artBuffer) {
	// Don't do anything if it's the same command again
	if ((_art->lastIPProg + 20) > millis())
		return;
	_art->lastIPProg = millis();

	byte command = _artBuffer[14];

	// Enable DHCP
	if ((command & 0b11000000) == 0b11000000) {
		_art->dhcp = true;

		// Disable DHCP
	}
	else if ((command & 0b11000000) == 0b10000000) {
		_art->dhcp = false;

		// Program IP
		if ((command & 0b10000100) == 0b10000100)
			_art->deviceIP = IPAddress(_artBuffer[16], _artBuffer[17], _artBuffer[18], _artBuffer[19]);

		// Program subnet
		if ((command & 0b10000010) == 0b10000010) {
			_art->subnet = IPAddress(_artBuffer[20], _artBuffer[21], _artBuffer[22], _artBuffer[23]);
			_art->broadcastIP = IPAddress((uint32_t)_art->deviceIP | ~((uint32_t)_art->subnet));
		}

