JonasArnold/ArtNetE131Lib_esp8266/ArtNetE131Lib.cpp
		// Use default address
		if ((command & 0b10001000) == 0b10001000)
			setDefaultIP();
	}

	// Run callback - must be before reply for correct dhcp setting
	if (_art->ipCallBack != 0)
		_art->ipCallBack();

	// Send reply
	_artIPProgReply();

	// Send artPollReply
	artPollReply();
}

void espArtNetRDM::_artIPProgReply() {
	// Initialise our reply
	char ipProgReply[ARTNET_IP_PROG_REPLY_SIZE];

	ipProgReply[0] = 'A';
	ipProgReply[1] = 'r';
	ipProgReply[2] = 't';
	ipProgReply[3] = '-';
	ipProgReply[4] = 'N';
	ipProgReply[5] = 'e';
	ipProgReply[6] = 't';
	ipProgReply[7] = 0;
	ipProgReply[8] = ARTNET_IP_PROG_REPLY;      // op code lo-hi
	ipProgReply[9] = ARTNET_IP_PROG_REPLY >> 8; // 0x2100 = artPollReply
	ipProgReply[10] = 0;
	ipProgReply[11] = 14;                 // artNet version (14)
	ipProgReply[12] = 0;
	ipProgReply[13] = 0;
	ipProgReply[14] = 0;
	ipProgReply[15] = 0;
	ipProgReply[16] = _art->deviceIP[0];  // ip address
	ipProgReply[17] = _art->deviceIP[1];
	ipProgReply[18] = _art->deviceIP[2];
	ipProgReply[19] = _art->deviceIP[3];
	ipProgReply[20] = _art->subnet[0];    // subnet address
	ipProgReply[21] = _art->subnet[1];
	ipProgReply[22] = _art->subnet[2];
	ipProgReply[23] = _art->subnet[3];
	ipProgReply[24] = 0;
	ipProgReply[25] = 0;
	ipProgReply[26] = (_art->dhcp) ? (1 << 6) : 0;  // DHCP enabled
	ipProgReply[27] = 0;
	ipProgReply[28] = 0;
	ipProgReply[29] = 0;
	ipProgReply[30] = 0;
	ipProgReply[31] = 0;
	ipProgReply[32] = 0;
	ipProgReply[33] = 0;

	// Send packet
	eUDP.beginPacket(eUDP.remoteIP(), ARTNET_PORT);
	int test = eUDP.write(ipProgReply, ARTNET_IP_PROG_REPLY_SIZE);
	eUDP.endPacket();
}

void espArtNetRDM::_artAddress(unsigned char *_artBuffer) {
	// _artBuffer[13]    bindIndex
	uint8_t g = _artBuffer[13] - 1;

	// Set net switch
	if ((_artBuffer[12] & 0x80) == 0x80)
		_art->group[g]->netSwitch = _artBuffer[12] & 0x7F;

	// Set short name
	if (_artBuffer[14] != '\0') {
		for (int x = 0; x < ARTNET_SHORT_NAME_LENGTH; x++)
			_art->shortName[x] = _artBuffer[x + 14];
	}

	// Set long name
	if (_artBuffer[32] != '\0') {
		for (int x = 0; x < ARTNET_LONG_NAME_LENGTH; x++)
			_art->longName[x] = _artBuffer[x + 32];
	}

	// Set Port Address
	for (int x = 0; x < 4; x++) {
		if ((_artBuffer[100 + x] & 0xF0) == 0x80 && _art->group[g]->ports[x] != 0)
			_art->group[g]->ports[x]->portUni = _artBuffer[100 + x] & 0x0F;
	}

	// Set subnet
	if ((_artBuffer[104] & 0xF0) == 0x80) {
		_art->group[g]->subnet = _artBuffer[104] & 0x0F;
	}

	// Get port number
	uint8_t p = _artBuffer[106] & 0x0F;

	// Command
	switch (_artBuffer[106]) {
	case ARTNET_AC_CANCEL_MERGE:
		_art->group[g]->cancelMergeTime = millis();
		_art->group[g]->cancelMergeIP = eUDP.remoteIP();

		/*
		for (int x = 0; x < 4; x++) {
		  if (_art->group[g]->ports[x] == 0)
			continue;

		  // Delete merge buffer if it exists
		  if (_art->group[g]->ports[x]->ipBuffer != 0) {
			os_free(_art->group[g]->ports[x]->ipBuffer);
			_art->group[g]->ports[x]->ipBuffer = 0;
		  }

		  // Update our timer variables
		  _art->group[g]->ports[x]->lastPacketTime[0] = 0;
		  _art->group[g]->ports[x]->lastPacketTime[1] = 0;
		}
		*/
		break;

	case ARTNET_AC_MERGE_LTP_0:
	case ARTNET_AC_MERGE_LTP_1:
	case ARTNET_AC_MERGE_LTP_2:
	case ARTNET_AC_MERGE_LTP_3:
		if (_art->group[g]->ports[p] != 0) {
			// Delete merge buffer if it exists
			if (_art->group[g]->ports[p]->ipBuffer != 0) {
				os_free(_art->group[g]->ports[p]->ipBuffer);
				_art->group[g]->ports[p]->ipBuffer = 0;
			}

			// Update our timer variables
			_art->group[g]->ports[p]->lastPacketTime[0] = 0;
			_art->group[g]->ports[p]->lastPacketTime[1] = 0;

			// Set to LTP
			_art->group[g]->ports[p]->mergeHTP = false;

			// Cancel the cancel merge
			_art->group[g]->cancelMerge = 0;
			_art->group[g]->cancelMergeIP = INADDR_NONE;
		}
		break;

	case ARTNET_AC_MERGE_HTP_0:
	case ARTNET_AC_MERGE_HTP_1:
	case ARTNET_AC_MERGE_HTP_2:
	case ARTNET_AC_MERGE_HTP_3:
		// Set to HTP
		if (_art->group[g]->ports[p] != 0) {
			_art->group[g]->ports[p]->mergeHTP = true;

			// Cancel the cancel merge
			_art->group[g]->cancelMerge = 0;
			_art->group[g]->cancelMergeIP = INADDR_NONE;
		}
		break;

	case ARTNET_AC_CLEAR_OP_0:
	case ARTNET_AC_CLEAR_OP_1:
	case ARTNET_AC_CLEAR_OP_2:
	case ARTNET_AC_CLEAR_OP_3:
		if (_art->group[g]->ports[p] == 0) {
			// Delete merge buffer if it exists
			if (_art->group[g]->ports[p]->ipBuffer != 0) {
				os_free(_art->group[g]->ports[p]->ipBuffer);
				_art->group[g]->ports[p]->ipBuffer = 0;
			}

			// Clear the DMX output buffer
			_artClearDMXBuffer(_art->group[g]->ports[p]->dmxBuffer);
		}
		break;


	case ARTNET_AC_ARTNET_SEL_0:
	case ARTNET_AC_ARTNET_SEL_1:
	case ARTNET_AC_ARTNET_SEL_2:
	case ARTNET_AC_ARTNET_SEL_3:
		for (uint8_t x = 0; x < 4; x++) {
			if (_art->group[g]->ports[x] == 0)
				setProtocolType(g, x, protocol_type::ARTNET);
		}
		break;

	case ARTNET_AC_ACN_SEL_0:
	case ARTNET_AC_ACN_SEL_1:
	case ARTNET_AC_ACN_SEL_2:
	case ARTNET_AC_ACN_SEL_3:
		for (uint8_t x = 0; x < 4; x++) {
			if (_art->group[g]->ports[p] == 0)
				setProtocolType(g, p, protocol_type::SACN_UNICAST);
		}
		break;

	}

	// Send reply
	artPollReply();

	// Run callback
	if (_art->addressCallBack != 0)
		_art->addressCallBack();
}

void espArtNetRDM::_artSync(unsigned char *_artBuffer) {
	// Update sync timer
	_art->lastSync = millis();

	// Run callback
	if (_art->syncCallBack != 0)// && _art->syncIP == eUDP.remoteIP())
		_art->syncCallBack();
}

void espArtNetRDM::_artFirmwareMaster(unsigned char *_artBuffer) {
	//Serial.println("artFirmwareMaster");
}

void espArtNetRDM::_artTODRequest(unsigned char *_artBuffer) {
	byte net = _artBuffer[21];
	group_def* group;

	uint8_t numAddress = _artBuffer[23];
	uint8_t addr = 24;

	// Handle artTodControl requests
	if (_artOpCode(_artBuffer) == ARTNET_TOD_CONTROL) {
		numAddress = 1;
		addr = 23;
	}

	for (int g = 0; g < _art->numGroups; g++) {
		group = _art->group[g];

		// Net matches so loop through the addresses
		if (group->netSwitch == net) {
			for (int y = 0; y < numAddress; y++) {

				// Subnet doesn't match, try the next address
				if (group->subnet != (_artBuffer[addr + y] >> 4))
					continue;

				// Subnet matches so loop through the 4 ports and check universe
				for (int p = 0; p < 4; p++) {

					if (group->ports[p] == 0)
						continue;

					port_def* port = group->ports[p];

					if (port->portUni != (_artBuffer[addr + y] & 0x0F))
						continue;

					port->lastTodCommand = millis();

