JonasArnold/ArtNetE131Lib_esp8266/ArtNetE131Lib.cpp
					// Flush TOD
					if (_artBuffer[22] == 0x01)
						_art->todFlushCallBack(g, p);

					// TOD Request
					else
						_art->todRequestCallBack(g, p);
				}
			}


		}
	}

}

void espArtNetRDM::artTODData(uint8_t g, uint8_t p, uint16_t* uidMan, uint32_t* uidDev, uint16_t uidTotal, uint8_t state) {
	if (_art == 0)
		return;

	// Initialise our reply
	uint16_t len = ARTNET_TOD_DATA_SIZE + (6 * uidTotal);
	char artTodData[len];
	artTodData[0] = 'A';
	artTodData[1] = 'r';
	artTodData[2] = 't';
	artTodData[3] = '-';
	artTodData[4] = 'N';
	artTodData[5] = 'e';
	artTodData[6] = 't';
	artTodData[7] = 0;
	artTodData[8] = ARTNET_TOD_DATA;      // op code lo-hi
	artTodData[9] = ARTNET_TOD_DATA >> 8;
	artTodData[10] = 0;
	artTodData[11] = 14;                 // artNet version (14)
	artTodData[12] = 0x01;               // rdm standard Ver 1.0
	artTodData[13] = p + 1;                // port number (1-4 not 0-3)
	artTodData[14] = 0;
	artTodData[15] = 0;
	artTodData[16] = 0;
	artTodData[17] = 0;
	artTodData[18] = 0;
	artTodData[19] = 0;
	artTodData[20] = g + 1;                // bind index
	artTodData[21] = _art->group[g]->netSwitch;

	if (state == RDM_TOD_READY)
		artTodData[22] = 0x00;             // TOD full
	else
		artTodData[22] = 0xFF;             // TOD not avail or incomplete

	artTodData[23] = (_art->group[g]->subnet << 4) | _art->group[g]->ports[p]->portUni;
	artTodData[24] = uidTotal >> 8;      // number of RDM devices found
	artTodData[25] = uidTotal;

	uint8_t blockCount = 0;
	uint16_t uidPos = 0;

	uint16_t f = uidTotal;

	while (1) {
		artTodData[26] = blockCount;
		artTodData[27] = (uidTotal > 200) ? 200 : uidTotal;

		uint8_t uidCount = 0;

		// Add RDM UIDs (48 bit each) - max 200 per packet
		for (uint16_t xx = 28; uidCount < 200 && uidTotal > 0; uidCount++) {
			uidTotal--;

			artTodData[xx++] = uidMan[uidTotal] >> 8;
			artTodData[xx++] = uidMan[uidTotal];
			artTodData[xx++] = uidDev[uidTotal] >> 24;
			artTodData[xx++] = uidDev[uidTotal] >> 16;
			artTodData[xx++] = uidDev[uidTotal] >> 8;
			artTodData[xx++] = uidDev[uidTotal];
		}

		// Send packet
		eUDP.beginPacket(_art->broadcastIP, ARTNET_PORT);
		int test = eUDP.write(artTodData, len);
		eUDP.endPacket();

		if (uidTotal == 0)
			break;

		blockCount++;
	}
}

void espArtNetRDM::_artTODControl(unsigned char *_artBuffer) {
	_artTODRequest(_artBuffer);
}

void espArtNetRDM::_artRDM(unsigned char *_artBuffer, uint16_t packetSize) {
	if (_art->rdmCallBack == 0)
		return;

	IPAddress remoteIp = eUDP.remoteIP();

	byte net = _artBuffer[21] * 0x7F;
	byte sub = _artBuffer[23] >> 4;
	byte uni = _artBuffer[23] & 0x0F;

	// Get RDM data into out buffer ready to send
	rdm_data c;
	c.buffer[0] = 0xCC;
	memcpy(&c.buffer[1], &_artBuffer[24], _artBuffer[25] + 2);

	group_def* group = 0;
	unsigned long timeNow = millis();

	// Get the group number
	for (int x = 0; x < _art->numGroups; x++) {
		if (net == _art->group[x]->netSwitch && sub == _art->group[x]->subnet) {
			group = _art->group[x];

			// Get the port number
			for (int y = 0; y < 4; y++) {

				// If the port isn't in use
				if (group->ports[y] == 0 || group->ports[y]->portType != RECEIVE_RDM)
					continue;

				// Run callback
				if (uni == group->ports[y]->portUni) {
					_art->rdmCallBack(x, y, &c);

					bool ipSet = false;

					for (int q = 0; q < 5; q++) {
						// Check when last packets where received.  Clear if over 200ms
						if (timeNow >= (group->ports[y]->rdmSenderTime[q] + 200))
							group->ports[y]->rdmSenderIP[q] = INADDR_NONE;

						// Save our IP
						if (!ipSet) {
							if (group->ports[y]->rdmSenderIP[q] == INADDR_NONE || group->ports[y]->rdmSenderIP[q] == remoteIp) {
								group->ports[y]->rdmSenderIP[q] = remoteIp;
								group->ports[y]->rdmSenderTime[q] = timeNow;
								ipSet = true;
							}
						}
					}
				}
			}
		}
	}
}

void espArtNetRDM::rdmResponse(rdm_data* c, uint8_t g, uint8_t p) {
	if (_art == 0)
		return;

	uint16_t len = ARTNET_RDM_REPLY_SIZE + c->packet.Length + 1;
	// Initialise our reply
	char rdmReply[len];

	rdmReply[0] = 'A';
	rdmReply[1] = 'r';
	rdmReply[2] = 't';
	rdmReply[3] = '-';
	rdmReply[4] = 'N';
	rdmReply[5] = 'e';
	rdmReply[6] = 't';
	rdmReply[7] = 0;
	rdmReply[8] = ARTNET_RDM;          // op code lo-hi
	rdmReply[9] = ARTNET_RDM >> 8;
	rdmReply[10] = 0;
	rdmReply[11] = 14;                 // artNet version (14)
	rdmReply[12] = 0x01;               // RDM version - RDM STANDARD V1.0

	for (uint8_t x = 13; x < 21; x++)
		rdmReply[x] = 0;

	rdmReply[21] = _art->group[g]->netSwitch;
	rdmReply[22] = 0x00;              // Command - 0x00 = Process RDM Packet
	rdmReply[23] = (_art->group[g]->subnet << 4) | _art->group[g]->ports[p]->portUni;

	// Copy everything except the 0xCC start code
	memcpy(&rdmReply[24], &c->buffer[1], c->packet.Length + 1);

	for (int x = 0; x < 5; x++) {
		if (_art->group[g]->ports[p]->rdmSenderIP[x] != INADDR_NONE) {
			// Send packet
			eUDP.beginPacket(_art->group[g]->ports[p]->rdmSenderIP[x], ARTNET_PORT);
			int test = eUDP.write(rdmReply, len);
			eUDP.endPacket();
		}
	}
}

void espArtNetRDM::_artRDMSub(unsigned char *_artBuffer) {
	//Serial.println("artRDMSub");
}

IPAddress espArtNetRDM::getIP() {
	if (_art == 0)
		return INADDR_NONE;
	return _art->deviceIP;
}

IPAddress espArtNetRDM::getSubnetMask() {
	if (_art == 0)
		return INADDR_NONE;
	return _art->subnet;
}

bool espArtNetRDM::getDHCP() {
	if (_art == 0)
		return 0;
	return _art->dhcp;
}


void espArtNetRDM::setIP(IPAddress ip, IPAddress subnet) {
	if (_art == 0)
		return;
	_art->deviceIP = ip;

	if ((uint32_t)subnet != 0)
		_art->subnet = subnet;

	_art->broadcastIP = IPAddress((uint32_t)_art->deviceIP | ~((uint32_t)_art->subnet));
}

void espArtNetRDM::setDHCP(bool d) {
	if (_art == 0)
		return;
	_art->dhcp = d;
}

void espArtNetRDM::setNet(uint8_t g, uint8_t net) {
	if (_art == 0 || g >= _art->numGroups)
		return;
	_art->group[g]->netSwitch = net;
}

uint8_t espArtNetRDM::getNet(uint8_t g) {
	if (_art == 0 || g >= _art->numGroups)
		return 0;
	return _art->group[g]->netSwitch;
}

