JonasArnold/ArtNetE131Lib_esp8266/ArtNetE131Lib.cpp
void espArtNetRDM::setSubNet(uint8_t g, uint8_t sub) {
	if (_art == 0 || g >= _art->numGroups)
		return;
	_art->group[g]->subnet = sub;
}

byte espArtNetRDM::getSubNet(uint8_t g) {
	if (_art == 0 || g >= _art->numGroups)
		return 0;
	return _art->group[g]->subnet;
}

void espArtNetRDM::setUni(uint8_t g, uint8_t p, uint8_t uni) {
	if (_art == 0 || g >= _art->numGroups || _art->group[g]->ports[p] == 0)
		return;
	_art->group[g]->ports[p]->portUni = uni;
}

byte espArtNetRDM::getUni(uint8_t g, uint8_t p) {
	if (_art == 0 || g >= _art->numGroups || _art->group[g]->ports[p] == 0)
		return 0;
	return _art->group[g]->ports[p]->portUni;
}


void espArtNetRDM::setPortType(uint8_t g, uint8_t p, uint8_t t) {
	if (_art == 0 || g >= _art->numGroups || _art->group[g]->ports[p] == 0)
		return;

	_art->group[g]->ports[p]->portType = t;
}

void espArtNetRDM::setMerge(uint8_t g, uint8_t p, bool htp) {
	if (_art == 0 || g >= _art->numGroups || _art->group[g]->ports[p] == 0)
		return;
	_art->group[g]->ports[p]->mergeHTP = htp;
}

bool espArtNetRDM::getMerge(uint8_t g, uint8_t p) {
	if (_art == 0 || g >= _art->numGroups || _art->group[g]->ports[p] == 0)
		return 0;
	return _art->group[g]->ports[p]->mergeHTP;
}



void espArtNetRDM::setShortName(char* name) {
	if (_art == 0)
		return;
	memcpy(_art->shortName, name, ARTNET_SHORT_NAME_LENGTH);
}

char* espArtNetRDM::getShortName() {
	if (_art == 0)
		return NULL;
	return _art->shortName;
}


void espArtNetRDM::setLongName(char* name) {
	if (_art == 0)
		return;
	memcpy(_art->longName, name, ARTNET_LONG_NAME_LENGTH);
}

char* espArtNetRDM::getLongName() {
	if (_art == 0)
		return NULL;
	return _art->longName;
}

void espArtNetRDM::setNodeReport(char* c, uint16_t code) {
	if (_art == 0)
		return;

	strcpy(_art->nodeReport, c);
	_art->nodeReportCode = code;
}

void espArtNetRDM::sendDMX(uint8_t g, uint8_t p, IPAddress bcAddress, uint8_t* data, uint16_t length) {
	if (_art == 0 || _art->numGroups <= g || _art->group[g]->ports[p] == 0)
		return;

	uint8_t net = _art->group[g]->netSwitch;
	uint8_t subnet = _art->group[g]->subnet;
	uint8_t uni = _art->group[g]->ports[p]->portUni;

	// length is always even and up to 512 channels
	if (length % 2)
		length += 1;
	if (length > 512)
		length = 512;

	_art->group[g]->ports[p]->dmxChans = length;

	unsigned char _artDMX[ARTNET_BUFFER_MAX];
	_artDMX[0] = 'A';
	_artDMX[1] = 'r';
	_artDMX[2] = 't';
	_artDMX[3] = '-';
	_artDMX[4] = 'N';
	_artDMX[5] = 'e';
	_artDMX[6] = 't';
	_artDMX[7] = 0;
	_artDMX[8] = ARTNET_ARTDMX;      	// op code lo-hi
	_artDMX[9] = ARTNET_ARTDMX >> 8;
	_artDMX[10] = 0;  		   	// protocol version (14)
	_artDMX[11] = 14;
	_artDMX[12] = _dmxSeqID++;		// sequence ID
	_artDMX[13] = p;		   	// Port ID (not really necessary)
	_artDMX[14] = (subnet << 4) | uni;	// Subuni
	_artDMX[15] = (net & 0x7F);		// Netswitch
	_artDMX[16] = (length >> 8);		// DMX Data length
	_artDMX[17] = (length & 0xFF);

	for (uint16_t x = 0; x < length; x++)
		_artDMX[18 + x] = data[x];

	// Send packet
	eUDP.beginPacket(bcAddress, ARTNET_PORT);
	eUDP.write(_artDMX, (18 + length));
	eUDP.endPacket();

}

void espArtNetRDM::setProtocolType(uint8_t g, uint8_t p, uint8_t type) {
	if (_art == 0 || _art->numGroups <= g || _art->group[g]->ports[p] == 0)
		return;

	// Increment or decrement our e131Count variable if the universe was artnet before and is now sACN
	if (_art->group[g]->ports[p]->protocol == ARTNET && type != ARTNET) {

		// Clear the DMX output buffer
		_artClearDMXBuffer(_art->group[g]->ports[p]->dmxBuffer);

	}  // if it was not an sACN before and it is an ArtNet now => decrement
	else if (_art->group[g]->ports[p]->protocol != ARTNET && type == ARTNET)
	{

		// Clear the DMX output buffer
		_artClearDMXBuffer(_art->group[g]->ports[p]->dmxBuffer);
	}

	_art->group[g]->ports[p]->protocol = type;
}

uint8_t espArtNetRDM::getProtocolType(uint8_t g, uint8_t p)
{
	return _art->group[g]->ports[p]->protocol;
}






